
echo "-------------------------------------------------------"

echo "Имя каталога, в котором находимся в данный момент входа:"

echo

pwd

echo "-------------------------------------------------------"

echo "Кто работает в системе:"

echo

who

echo "-------------------------------------------------------"

echo "Номера запущенных процессов:"

echo

pgrep -u vlad -d ", "

echo "-------------------------------------------------------"

echo "Текущее время и дата:"

echo

date +"%H:%M %d.%m.%Y"

echo "-------------------------------------------------------"

echo "Типы файлов в текущем каталоге:"

echo

file ./task1.sh

echo "-------------------------------------------------------"

echo "Процент занятости дисковой памяти:"

echo

free | grep Mem | awk '{print $3*100/$2}'

echo "-------------------------------------------------------"

echo "Местоположение вызванных ранее команд:"

echo

whereis pwd
whereis who
whereis pgrep
whereis date
whereis free
whereis whereis

echo "-------------------------------------------------------"